# Brewfile — lean core CLI toolchain for an SRE workstation.
#
# Scope: the tools actually used day-to-day — Terraform, Kubernetes, Ghostty,
# Helix, GitUI — plus the shell/search/git plumbing they depend on. Everything
# here is cross-platform (macOS + Linuxbrew). GUI apps live in Brewfile.casks
# and are opt-in.
#
#   brew bundle --file=homebrew/Brewfile          # core (installed by setup)
#   brew bundle --file=homebrew/Brewfile.casks    # optional GUI apps (macOS)

tap "turbot/tap"

# --- Shell & core plumbing --------------------------------------------------
brew "git"
brew "stow"            # symlink manager used by the installer
brew "zsh"
brew "coreutils"
brew "findutils"
brew "moreutils"
brew "direnv"
brew "zoxide"          # `z` / cd replacement
brew "gnupg"           # signed commits
brew "pinentry"                             # generic (Linux fallback)
brew "pinentry-mac" if OS.mac?              # native macOS GUI + Keychain integration
brew "openssh"
brew "wget"
brew "tree"
brew "watch"
brew "tldr"
brew "gh"              # GitHub CLI (config is stowed)

# --- Editors & TUIs ---------------------------------------------------------
brew "helix"           # primary editor (hx)
brew "neovim"          # secondary (vim/nv aliases, kickstart submodule)
brew "gitui"           # git TUI
brew "zellij"          # terminal multiplexer

# --- Search / files / diff --------------------------------------------------
brew "fzf"
brew "fd"
brew "ripgrep"         # `rg` (aliased over grep in .aliases)
brew "bat"             # `cat` replacement (aliased)
brew "eza"             # maintained `exa` fork
brew "jq"
brew "yq"
brew "git-delta"       # `delta` diff pager
brew "dust"            # `du` replacement (aliased)

# --- Language servers (for Helix) -------------------------------------------
brew "bash-language-server"
brew "taplo"           # TOML LSP
brew "terraform-ls"

# --- Terraform --------------------------------------------------------------
brew "tfenv"           # Terraform version manager (installs terraform binaries)
brew "terraform-docs"

# --- Kubernetes -------------------------------------------------------------
brew "kubernetes-cli"  # kubectl
brew "kubectx"         # kubectx + kubens
brew "kustomize"
brew "krew"            # kubectl plugin manager
brew "helm"
brew "kubeconform"     # manifest validation
brew "kube-ps1"        # kube context in prompt
brew "argocd"

# --- Languages / runtimes ---------------------------------------------------
brew "go"              # also builds the setup_quanianitis installer
brew "python@3.11"
brew "pyenv"           # lazy-loaded in .zshrc

# --- Cloud / query ----------------------------------------------------------
brew "awscli"
brew "steampipe"       # SQL over cloud/k8s/terraform (configs are stowed)

# --- AI / dev tools --------------------------------------------------------
brew "opencode"        # AI coding agent

# --- Network debugging -----------------------------------------------------
brew "telnet"
brew "nmap"
brew "mtr"             # traceroute + ping combined
brew "tcpdump"

# --- System ----------------------------------------------------------------
brew "btop"            # resource monitor
