tap "anomalyco/tap"
tap "buildpacks/tap"
tap "cloudflare/cloudflare"
tap "codefresh-io/cli"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "turbot/tap"

brew "aliyun-cli"
brew "anomalyco/tap/opencode"
brew "ansible"
brew "ansible-language-server"
brew "argocd"
brew "awscli"
brew "bash-language-server"
brew "boost-python3"
brew "btop"
brew "cilium-cli"
brew "cmake"
brew "conftest"
brew "coreutils"
brew "csvlens"
brew "direnv"
brew "docker-ls"
brew "dust"
brew "eza"            # exa is unmaintained; eza is the maintained fork
brew "fd"
brew "findutils"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glib"
brew "gnupg"
brew "gnutls"
brew "go"
brew "helix"
brew "helm"
brew "httpie"
brew "jless"
brew "jq"
brew "kafka"
brew "krew"
brew "kube-ps1"
brew "kubeconform"
brew "kubectx"
brew "kubent"
brew "kustomize"
brew "libgit2@1.7"
brew "libpq", link: true
brew "libtermkey"
brew "minicom"
brew "mkcert"
brew "moreutils"
brew "mprocs"
brew "neovim"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "openssh"
brew "packer"
brew "parallel"
brew "pgcli"
brew "pinentry"
brew "pinentry-mac"
brew "pv"
brew "pyenv"
brew "python@3.11"
brew "qpdf"
brew "rename"
brew "rg"
brew "rlwrap"
brew "rust"
brew "screen"
brew "socat"
brew "sqlmap"
brew "ssh-copy-id"
brew "starship"
brew "steampipe"
brew "stow"
brew "taplo"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "terraform-docs"
brew "terraform-ls"
brew "terraformer"
brew "tfenv"
brew "tldr"
brew "tmux"
brew "tree"
brew "ucspi-tcp"
brew "unbound"
brew "vbindiff"
brew "watch"
brew "wget"
brew "xsv"
brew "yq"
brew "zellij"
brew "zoxide"

brew "buildpacks/tap/pack"
brew "cloudflare/cloudflare/cf-terraforming"
brew "hashicorp/tap/terraform", link: false
brew "turbot/tap/powerpipe"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "foxit-reader"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "google-drive"
cask "obsidian"
cask "openlens"
cask "orbstack"
cask "rectangle"
cask "spotify"
cask "telegram"
cask "twingate"
cask "whatsapp"
cask "zed"
cask "font-fira-code-nerd-font"
